IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WS-ACCEPT PIC X(4095).
        01 WS-A      PIC 9(4) VALUE 0. 
        01 WS-I      PIC 9(4) VALUE 0.
        01 WS-J      PIC 9(4) VALUE 0.
        01 WS-FOUND  PIC 9(4) VALUE 0. 
        01 WS-COUNT  PIC 9(4) VALUE 0. 
        01 WS-ACTUAL-LENGTH  PIC 9(4) VALUE 0. 
        01 WS-FLAG   PIC X(1) VALUE SPACES.
        01 WS-TEMP   PIC X(14) VALUE SPACES.
PROCEDURE DIVISION.
    ACCEPT WS-ACCEPT
    INSPECT FUNCTION REVERSE(WS-ACCEPT) TALLYING WS-COUNT FOR LEADING SPACE.
    SUBTRACT WS-COUNT FROM FUNCTION LENGTH(WS-ACCEPT) GIVING WS-ACTUAL-LENGTH.
    
    PERFORM VARYING WS-A FROM 1 BY 1 UNTIL WS-A > WS-ACTUAL-LENGTH
        INITIALIZE  WS-FLAG
                    WS-TEMP
                    WS-I
                    WS-J
        MOVE WS-ACCEPT(WS-A:14) TO WS-TEMP
        PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 14
            PERFORM VARYING WS-J FROM 1 BY 1 UNTIL WS-J > 14
                IF WS-TEMP(WS-J:1) EQUAL WS-TEMP(WS-I:1) AND WS-J NOT EQUAL WS-I
                    MOVE 'Y' TO WS-FLAG
                END-IF
            END-PERFORM
        END-PERFORM
        IF WS-FLAG NOT EQUAL 'Y'
            COMPUTE WS-FOUND = WS-A + 13
            GO TO 0100-PERFORM-EXIT
        END-IF
    END-PERFORM.
    
    0100-PERFORM-EXIT. EXIT.
    
    DISPLAY 'No. of characters processed before first start-of-message marker: ' WS-FOUND
STOP RUN.

